In [142]:
x = 5
y = 5
z = 5 * 5
print(z)

25

In [143]:
radius = 2
PI = 3.14
area = PI * radius ** 2
print(area)

12.56

In [144]:
name = "Ben"
job = "Information Analyst"
conc = name + " " + job
print (conc)

phrase = f"my name is {name} and i am an {job} ."
print(phrase)

Ben Information Analyst
my name is Ben and i am an Information Analyst .

In [145]:
cin_plans = 200
total_pop = 15500
RP10k = (cin_plans / total_pop)*10000
ex = f"the rate of con plans per 10k kids is {RP10k}"
print(ex)

the rate of con plans per 10k kids is 129.03225806451613

In [146]:
filename = "c://desktop/data/309_header.csv"
print(filename)

substring = filename[10:16]
print(substring)

substring2 = filename[-4:]
print(substring2)

substring3 = filename[17:-4:2]
long = f'filename = {substring3}'
print(substring3)
print(long)

c://desktop/data/309_header.csv
p/data
.csv
39hae
filename = 39hae

In [147]:
phrase = "reverse this phrase"
reversed = phrase[-1::-1]
print(reversed)

esarhp siht esrever

In [148]:
Slice_this_phrse = 'dog cat racoon'
animal_1 = Slice_this_phrse [0:3]
animal_2 = Slice_this_phrse [4:7]
animal_3 =  Slice_this_phrse [8:]
print(animal_1)
print(animal_2)
print(animal_3)

dog
cat
racoon

In [149]:
list_1 = [1, phrase, long, "hi"]
print(list_1)

[1, 'reverse this phrase', 'filename = 39hae', 'hi']

In [150]:
colours = ['red', 'blue', 'green', 'purple']
colours.append(['teal', 'orange'])
print(colours[4])

more_colours = ["brown","gold","white"]
colours.extend(more_colours)
print(colours)

colours.append("red")

print(colours)

colours.remove('red')
print(colours)

['teal', 'orange']
['red', 'blue', 'green', 'purple', ['teal', 'orange'], 'brown', 'gold', 'white']
['red', 'blue', 'green', 'purple', ['teal', 'orange'], 'brown', 'gold', 'white', 'red']
['blue', 'green', 'purple', ['teal', 'orange'], 'brown', 'gold', 'white', 'red']

In [151]:
x = 5
x = 6
x = 7
x += 1
x = 10
print(x)

10

In [152]:
my_strng = "here's a string"

In [153]:
import pandas as pd 

df = pd.DataFrame({'ChildId':['id1', 'id2', 'id3', 'id4', 'id5'],
                   'Age first contact':[6,12,11,1,19],
                   'Gender':['M','m', 'F', '', 'F' ],
                   'Birthday':['01/01/2002', '02/02/2003', pd.NA, '03/03/2023', '06/01/2012'],
                   'CP Plan?':['Y', 'n', 'N', 'No', 'yES'],})

df['Birthday'] = pd.to_datetime(df['Birthday'], format='%d/%m/%Y', errors='coerce')

df['Age March 31'] = pd.to_datetime('31/03/2024', dayfirst=True) - df['Birthday']
df['Age March 31'] = df['Age March 31'] / pd.Timedelta('365 days')
df['Age March 31'] = df['Age March 31'].round().astype('int', errors='ignore')

df['Age'] = pd.to_datetime('today').normalize() - df['Birthday']
df['Age'] = df['Age'] / pd.Timedelta('365 days')
df['Age'] = df['Age'].round().astype('int', errors='ignore')

print(df)

  ChildId  Age first contact Gender   Birthday CP Plan?  Age March 31   Age
0     id1                  6      M 2002-01-01        Y          22.0  22.0
1     id2                 12      m 2003-02-02        n          21.0  21.0
2     id3                 11      F        NaT        N           NaN   NaN
3     id4                  1        2023-03-03       No           1.0   1.0
4     id5                 19      F 2012-01-06      yES          12.0  12.0

In [154]:
gender_dict = {'M':'m',
               'm':'m',
               'F':'f',
               'f':'f'}
print(df)

df['Gender'] = df['Gender'].str.lower()

df['Gender'] = df['Gender'].replace(r'^\s*$',pd.NA, regex=True)

print(df)

  ChildId  Age first contact Gender   Birthday CP Plan?  Age March 31   Age
0     id1                  6      M 2002-01-01        Y          22.0  22.0
1     id2                 12      m 2003-02-02        n          21.0  21.0
2     id3                 11      F        NaT        N           NaN   NaN
3     id4                  1        2023-03-03       No           1.0   1.0
4     id5                 19      F 2012-01-06      yES          12.0  12.0
  ChildId  Age first contact Gender   Birthday CP Plan?  Age March 31   Age
0     id1                  6      m 2002-01-01        Y          22.0  22.0
1     id2                 12      m 2003-02-02        n          21.0  21.0
2     id3                 11      f        NaT        N           NaN   NaN
3     id4                  1   <NA> 2023-03-03       No           1.0   1.0
4     id5                 19      f 2012-01-06      yES          12.0  12.0

In [155]:
cp_cleaner = lambda row: 'y' if 'y' in row else 'n' if 'n' in row  else pd.NA

df['cp plan?'] = df['CP Plan?'].str.lower( ).apply(cp_cleaner)

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Age,cp plan?
0,id1,6,m,2002-01-01,Y,22.0,22.0,y
1,id2,12,m,2003-02-02,n,21.0,21.0,n
2,id3,11,f,NaT,N,NaN,NaN,n
3,id4,1,<NA>,2023-03-03,No,1.0,1.0,n
4,id5,19,f,2012-01-06,yES,12.0,12.0,y

In [156]:
new_child = {
    'ChildId':['id6'],
    'Age': [10],
    'Age first contact':[9],
    'Gender':['m'],
    'Birthday':[pd.to_datetime('28/02/2014', dayfirst=True)],
    'Age March 31':[10],
    'NHS Number':['78132']
}

new_child = pd.DataFrame(new_child)

df = pd.concat([df, new_child],ignore_index=True)

df.drop_duplicates(subset='ChildId', keep='last', inplace=True)

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Age,cp plan?,NHS Number
0,id1,6,m,2002-01-01,Y,22.0,22.0,y,NaN
1,id2,12,m,2003-02-02,n,21.0,21.0,n,NaN
2,id3,11,f,NaT,N,NaN,NaN,n,NaN
3,id4,1,<NA>,2023-03-03,No,1.0,1.0,n,NaN
4,id5,19,f,2012-01-06,yES,12.0,12.0,y,NaN
5,id6,9,m,2014-02-28,NaN,10.0,10.0,NaN,78132

In [157]:
nhs_numbers = pd.DataFrame([
                            {'ChildId':'id1',
                            'NHS Number': '303',},
                            {'ChildId':'id2',
                            'NHS Number': '3u5029',},
                            {'ChildId':'id3',
                            'NHS Number': 'gqw3',},
                            {'ChildId':'id4',
                            'NHS Number': 'avsgvb',},
                            {'ChildId':'id5',
                            'NHS Number': 'varwvw',},
                             {'ChildId':'id7',
                            'NHS Number': 'varwvw',},
                            ])

df = pd.merge(df, nhs_numbers, how='inner', left_on='ChildId',right_on='ChildId')

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Age,cp plan?,NHS Number_x,NHS Number_y
0,id1,6,m,2002-01-01,Y,22.0,22.0,y,NaN,303
1,id2,12,m,2003-02-02,n,21.0,21.0,n,NaN,3u5029
2,id3,11,f,NaT,N,NaN,NaN,n,NaN,gqw3
3,id4,1,<NA>,2023-03-03,No,1.0,1.0,n,NaN,avsgvb
4,id5,19,f,2012-01-06,yES,12.0,12.0,y,NaN,varwvw